Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: See below for how you can do it.) In this case, the button's event table will be searched, then the parent panel's, then the frame's.
ja: マウスイベントで同じことを実現する方法は以下を参照してください) この場合、まずボタンのイベントテーブルが検索され、続いて、その親パネル、フレームの順に検索されます。

source: See the event sample for an example of doing it.
ja: これを行なっているサンプルとして イベントサンプル を参照してください。

source: See the sample programs server and client in the IPC samples directory.
ja: IPC サンプルディレクトリにある server と client のサンプルプログラムを参照してください。

source: SeekI returns the last position
ja: SeekI はストリームの先頭から数えた

source: SeekI returns the last position // in the stream counted from the beginning. off_t old_position = in_stream.SeekI(0, wxFromBeginning); // What is my current position ? off_t position = in_stream.TellI(); // wxFileInputStream will close the file descriptor on destruction.
ja: SeekI はストリームの先頭から数えた // 最後の位置を返却する。 off_t old_position = in_stream.SeekI(0, wxFromBeginning); // 現在位置はどこ? off_t position = in_stream.TellI(); // wxFileInputStream はデストラクタでファイルディスクリプタを閉じる。

source: Sends an wxEVT_INIT_DIALOG event, whose handler usually transfers data to the dialog via validators...
ja: wxEVT_INIT_DIALOG イベントを送信します。通常、このイベントのハンドラはバリデータを通してダイアログへデータを転送します。

source: Sequence of Events During Window Deletion
ja: ウィンドウ削除時における一連のイベント

source: SetSizer( topsizer ); // use the sizer for layout
ja: SetSizer( topsizer ); // レイアウトにサイザーを使用する

source: SetSizerAndFit(topsizer); // use the sizer for layout and set size and hints }
ja: SetSizerAndFit(topsizer); // レイアウトにサイザーを使用し、サイズとヒントを設定する }

source: SetSizerAndFit(topsizer); // use the sizer for layout and size window
ja: SetSizerAndFit(topsizer); // レイアウトにサイザーを使用して

source: Sets the adaptation mode, overriding the global adaptation flag.
ja: 適応モードを設定し、グルーバルな適応フラグを上書きします。

source: Sets the aggressiveness of search for buttons and sizers to be in the non-scrolling part of a layout-...
ja: レイアウトの適応を行なうダイアログで非スクロール領域内に配置するボタンやサイザーを探す際の積極性を設定します。

source: Sets the event handler for this window.
ja: このウィンドウのイベントハンドラを設定します。

source: Sets the log level for the given component.
ja: 指定されたコンポーネントのログレベルを設定します。

source: Sets the maximum size of the window, to indicate to the sizer layout mechanism that this is the maxim...
ja: ウィンドウの最大サイズを設定し、これが取りうる最大のサイズであることをサイザーへ示します。

source: Sets the minimum size of the window, to indicate to the sizer layout mechanism that this is the minim...
ja: ウィンドウの最小サイズを設定し、これが最小の要求サイズであることをサイザーへ示します。

source: Sets the new text control value.
ja: テキストコントロールの新しい値を設定します。

source: Sets the pointer to the next handler.
ja: 次のイベントハンドラへのポインタを設定します。

source: Sets the return code for this window.
ja: このウィンドウの戻り値を設定します。

source: Sets the selection for the given page, returning the previous selection.
ja: 指定されたページを選択し、以前選択していたページを返却します。

source: Sets the size of the window in pixels.
ja: ピクセル単位でウィンドウサイズを設定します。

source: Sets the specified log target as the active one.
ja: 指定されたログターゲットを有効なログターゲットとして設定します。

source: Setting the appropriate locale in your program to use the strings for the given language: see wxLocale.
ja: 与えられた言語の文字列を使用するように、プログラム内で適切なロケールを設定する: wxLocale を参照してください。

source: Several of the wxWidgets-provided wxMBConv classes have predefined instances (wxConvLibc, wxConvFileName, wxConvUTF7, wxConvUTF8, wxConvLocal).
ja: wxWidgets の提供する wxMBConv クラスのうち、いくつかのクラスは事前に定義されたインスタンスを持っています。(wxConvLibc、wxConvFileName、wxConvUTF7、wxConvUTF8、wxConvLocal)

source: Show a general purpose message dialog.
ja: 汎用的なメッセージダイアログを表示します。

source: Shows an application-modal dialog.
ja: モーダルダイアログを表示します。

source: Shows or hides the window.
ja: ウィンドウの表示非表示を切り替えます。

source: Signature of wxDataViewCustomRenderer::StartDrag() virtual method changed.
ja: wxDataViewCustomRenderer::StartDrag() 仮想関数のシグネチャが変更されました。

source: Similar to the standard function sprintf().
ja: 標準の sprintf() 関数と似ています。

source: Similarly,
ja: 同様に、

source: Similarly, wxWX2WCbuf can be used for the return type of wxString::wc_str().
ja: 同様に、wxString::wc_str() の戻り値の型として wxWX2WCbuf を使用できます。

source: Simple events such as menu commands are usually processed at the level of a top-level window containing the menu, so let's suppose that you need to handle some events in MyFrame class deriving from wxFrame.
ja: メニューコマンドといった単純なイベントは普通、メニューを保持するトップレベルウィンドウで処理されます。そのため、いくつかのイベントは wxFrame を継承した MyFrame で処理する必要があるはずです。

source: Since iterating over a string by index is a common programming technique and was also possible and encouraged by wxString using the access operator[]() wxString implements caching of the last used index so that iterating over a string is a linear operation even in UTF-8 mode.
ja: インデックスによる文字列の走査はよく使われるプログラミングテクニックであり、wxString では operator[]() を使用することを推奨していたため、wxString は最後に使用したインデックスをキャッシュするように実装されています。これにより、UTF-8 モードであっても文字列全体の走査を線形時間で行なうことができます。

source: Since mb_str() returns a temporary wxCharBuffer to hold the result of the conversion, you need to explicitly cast it to const char* if you use it in a vararg context (like with printf).
ja: mb_str() は変換結果を保持する一時 wxCharBuffer を返却するため、(printf のような) 可変数引数の関数を使用する場合は明示的に const char* にキャストする必要があります。

source: Since the API and virtually all of the behaviour is the same apart from the names of the classes, you should find it easy to switch between the two implementations.
ja: クラス名を除いて API と仮想的な振る舞いがすべて同じであるため、ふたつの実装を簡単に切り替えられることに気がつくと思います。

source: Since the handler for this cancel event might itself call Close, there is a check for infinite looping.
ja: このキャンセルイベントのハンドラ自身が Close を呼ぶため、無限ループのチェックが行われます。

source: Since version 2.2.x of wxWidgets, each event type is identified by ID which is given to the event type at runtime which makes it possible to add new event types to the library or application without risking ID clashes (two different event types mistakingly getting the same event ID).
ja: wxWidgets 2.2.x から 実行時に 決定される ID を使用してイベントの型を識別します。これにより、ID の衝突を起こす (異なるふたつのイベント型が同じイベント ID を取得してしまう) ことなく、新しいイベント型をライブラリやアプリケーションに追加することができます。

source: Since wxWidgets 3.0 wxString internally uses UTF-16 (with Unicode code units stored in wchar_t) under Windows and UTF-8 (with Unicode code units stored in char) under Unix, Linux and Mac OS X to store its content.
ja: wxWidgets 3.0 から wxString の内部エンコーディングとして Windows では (Unicode コード単位を wchar_t に格納する) UTF-16 を、Unix、Linux、Mac OS X では (Unicode コード単位を char に格納する) UTF-8 を使用します。

source: Since wxWidgets 3.0 Unicode support is always enabled and while building the library without it is still possible, it is not recommended any longer and will cease to be supported in the near future.
ja: wxWidgets 3.0 からは Unicode が常に有効になります。Unicode を使用せずにライブラリをビルドすることはまだ可能ですが、もはや非推奨であり、近い将来、サポートされなくなります。

source: Situations where automatic scrolling adaptation may fail
ja: 自動スクロールの適応に失敗する状況

source: Sizers Overview
ja: サイザーの概要

source: Sizers distribute only the extra space between the stretchable items according to their proportions and not all available space.
ja: サイザーは利用可能なすべてのスペースではなく、余剰スペースのみを伸長可能なコントロール間でプロポーションにしたがって分配します。

source: Sizers, as represented by the wxSizer class and its descendants in the wxWidgets class hierarchy, have become the method of choice to define the layout of controls in dialogs in wxWidgets because of their ability to create visually appealing dialogs independent of the platform, taking into account the differences in size and style of the individual controls.
ja: wxWidgets のクラス階層における wxSizer クラスと、その子孫クラスによって代表されるサイザーは、wxWidgets においてダイアログ内のコントロールのレイアウトを決定するための選択法になりました。なぜなら、サイザーによって、各コントロールのサイズやスタイルの違いを考慮しつつ、プラットフォームに依存しない、視覚的に魅力的なダイアログを作ることができるためです。

source: Sizes the window so that it fits around its subwindows.
ja: サブウィンドウにフィットするようにウィンドウのサイズを設定します。

source: Small.
ja: 小さい。

source: So before you make the choice between static event tables and dynamically connecting the event handlers, let us discuss these two ways in more detail.
ja: そのため、イベントテーブルと動的イベントハンドラのいずれかを選択する前に、それぞれの方法についてより詳しく議論しておきましょう。

source: So even if the application has derived new classes to customize behaviour, your utility can indulge in a spot of body-snatching.
ja: そのため、アプリケーションの振る舞いをカスタマイズするために新しいクラスを継承していたとしても、あなたのユーティリティから自由に振る舞いを変更することができます。

source: So far we've been talking about 'managed' windows, i.e. frames and dialogs.
ja: これまでは 'マネージド' ウィンドウ、つまりフレームやダイアログについて話してきました。

source: So if using validators and a normal OK button, you may not even need to write any code for handling dialog dismissal.
ja: そのため、バリデータと通常の OK ボタンを使用している場合、ダイアログの終了処理を行なうためのコードを書く必要すらないでしょう。

source: So the existing code needs to be reviewed when upgrading to wxWidgets 3.0 and the new code should be used with this in mind and ideally avoiding implicit conversions to char*.
ja: そのため、wxWidgets 3.0 にアップグレードするときは既存のコードを見直す必要があるとともに、新しいコードではこのことを意識しつつ、理想的には char* への暗黙的な変換を避けるようにするべきです。.

source: So the question is: which one is better to use?
ja: そのため、質問は次のようになります: どの関数を使用すれば良いのか?

source: So this call may do any number of things (including displaying the correct string on screen), although the most likely result is a program crash.
ja: そのため、この関数呼び出しの結果は (文字列が正しく表示されることも含めて) 不定になりますが、一番起こりうるのはプログラムのクラッシュでしょう。

source: So this call may do anything at all (including displaying the correct string on screen), although the most likely result is a program crash.
ja: そのため、この関数呼び出しの結果は (文字列が正しく表示されることも含めて) 不定になりますが、一番起こりうるのはプログラムのクラッシュでしょう。

source: So which is better to use?
ja: そのため、どれを使うのが良いのでしょう?

source: So why the need for wxString?
ja: それなのになぜ wxString が必要なのでしょうか?

source: So you can consider this method to be a "Smart SetSize".
ja: そのため、この関数を "賢い SetSize" と考えることができます。

source: So you need to be able to convert the data to various representations and the wxString methods wxString::ToAscii(), wxString::ToUTF8() (or its synonym wxString::utf8_str()), wxString::mb_str(), wxString::c_str() and wxString::wc_str() can be used for this.
ja: そのため、データを様々な表現方法へ変換できる必要がありますが、そのための wxString の関数として wxString::ToAscii()、wxString::ToUTF8() (またはそのシノニムの wxString::utf8_str())、wxString::mb_str()、wxString::c_str()、wxString::wc_str() を使用できます。

source: Some Borland compilers refuse to work at all with them and using iostreams on Linux makes writing programs that are binary compatible across different Linux distributions, impossible.
ja: Borland のいくつかのコンパイラではまったく動作しませんし、Linux で iostream を使用すると異なる Linux ディストリビューション間でバイナリ互換性を保つことは不可能になります。

source: Some compilers (notably g++) warn about this but even if they don't, this
ja: いくつかのコンパイラ (特に g++) では警告が出ますし、仮に警告が出ないとしても

source: Some controls can calculate their height, but not their width (e.g. a single line text control):
ja: (単一行テキストコントロールなど) いくつかのコントロールでは自身の高さを計算できても、幅を計算することができません。

source: Some device contexts are created temporarily in order to draw on a window.
ja: いくつかのデバイスコンテキストはウィンドウへの描画のために一時的に作成されます。

source: Some handlers are provided as standard, but if you have special requirements, you may wish to initialise the wxBitmap class with some extra handlers which you write yourself or receive from a third party.
ja: いくつかのハンドラは標準で提供されていますが、特別な要件がある場合に自分で書いたハンドラやサードパーティーのハンドラを使用して wxBitmap クラスを初期化したいと思うかもしれません。

source: Some of advantages in using wxWidgets log functions are:
ja: wxWidgets のログ関数を使用するいくつかの利点は以下の通りです:

source: Some of wxLog implementations, most notably the standard wxLogGui class, buffer the messages (for exa...
ja: いくつかの wxLog の実装、特に標準の wxLogGui クラスではメッセージを (例えば無数のメッセージダイアログが次々と表示されるのを防止するために) バッファリングします。

source: Sometimes it is also necessary to go from ANSI strings to wxStrings.
ja: 時々、ANSI 文字列を wxString に変換する必要があります。

source: Sometimes you wish to use a .ico resource on Windows, and XPMs on other platforms (for example to take advantage of Windows' support for multiple icon resolutions).
ja: Windows では .ico リソースを、それ以外のプラットフォームでは xpm を使用したいと思うことがあるかもしれません。(例えば、Windows の対応している多重解像度のアイコンを有効活用するためにです)

source: Sorry, this topic has yet to be written.
ja: このトピックはまだ書かれていません。

source: Special preprocessor tokens (__FILE__, __DATE__ and __TIME__)
ja: 特別なプリプロセッサトークン (__FILE__, __DATE__, __TIME__)

source: Specifically, the danger of this implicit conversion may be seen in the following code fragment:
ja: 暗黙の型変換の具体的な危険性は以下のコードで分かると思います:

source: Specifies that log messages with level greater (numerically) than logLevel should be ignored and not ...
ja: (数値的に) logLevel より大きいログレベルを持つメッセージを無視し、有効なログターゲットに送信されないようにします。

source: Specify the source code language and charset as arguments to wxLocale::AddCatalog.
ja: wxLocale::AddCatalog の引数にソースコードの言語と文字コードを指定してください。

source: Standard C++ streams can cause problems on several platforms: they work quite well in most cases, but in the multi-threaded case, for example, they have many problems.
ja: 標準の C++ ストリームはいくつかのプラットフォームで問題を引き起こすことがあります: 大半はうまく動作しますが、例えばマルチスレッドの場合では多くの問題を抱えています。

source: Standard button and menu IDs.
ja: 標準ボタンとメニュー ID。

source: Starting with wxWidgets 2.9.1, logging functions can be safely called from any thread.
ja: wxWidgets 2.9.1 から、どのスレッドからでも安全にロギング関数を呼べるようになりました。

source: Starts editing the label of the given item.
ja: 指定された項目のラベル編集を開始します。

source: Starts the drag-and-drop operation which will terminate when the user releases the mouse...
ja: ドラッグ・アンド・ドロップ操作を開始します。ドラッグ・アンド・ドロップはユーザがマウスを放したときに終了します。

source: Stream Classes
ja: ストリームクラス

source: Stream classes overview
ja: ストリームクラスの概要

source: Stream filtering means a stream which does no syscall but filters data which are passed to it and then pass them to another stream.
ja: ストリームのフィルタリングとは、システムコールは行いませんが、渡されたデータをフィルタリングし、他のストリームへ引き渡すストリームを意味します。

source: String Related Functions and Classes
ja: 文字列に関する他の関数やクラス

source: String functions (strlen(), strcpy(), ...)
ja: 文字列関数 (strlen(), strcpy(), ...)

source: Such items are sometimes referred to as the children of the sizer.
ja: 時々、そのようなアイテムをサイザーの子と呼びます。

source: Such objects are implicitly convertible to char and wchar_t pointers, respectively, and so the result of, for example, wxString::ToUTF8() can always be passed directly to a function taking const char*.
ja: 返却されたオブジェクトは暗黙的に char ポインタや wchar_t ポインタへそれぞれ変換されます。そのため、例えば wxString::ToUTF8() の戻り値を const char* を受け取る関数へ常に渡すことができます。.

source: Supported Bitmap File Formats
ja: 対応しているビットマップファイル形式

source: TODO: Probably deprecated, Bind() provides a better way to do this
ja: TODO: おそらく非推奨であり、Bind() がより良い方法を提供しています。

source: Table of contents:
ja: 目次:

source: Tell the sizer to resize the window so that its client area matches the sizer's minimal size (Compute...
ja: ウィンドウをリサイズするようにサイザーへ通知し、クライアント領域がサイザーの最小サイズに合致するようにします。(サイズを決定するために ComputeFittingClientSize() が呼ばれます)

source: Test if this event should be propagated or not, i.e.
ja: イベントを伝播させる必要があるかどうかを確認します。

source: Thanks to this mechanism you can, for example, distribute only iso8859-13 data and it will be handled transparently under all systems.
ja: この仕組みのおかげで、例えば iso8859-13 のデータを配布するだけで、すべてのシステムでこのデータが透過的に処理されます。

source: The "IO" classes implements the specific parts of the stream.
ja: "IO" クラスはストリームの特定の部分を実装しています。

source: The "IO" classes: wxSocketInputStream, wxSocketOutputStream, wxFileInputStream, wxFileOutputStream, ...
ja: "IO" クラス: wxSocketInputStream, wxSocketOutputStream, wxFileInputStream, wxFileOutputStream, ...

source: The wxBitmap class encapsulates the concept of a platform-dependent bitmap, either monochrome or colour.
ja: wxBitmap クラスはモノクロとカラーの両方について、プラットフォームに依存するビットマップの概念をカプセル化するものです。

source: The wxCSConv class is special because when it is instantiated, you can tell it which character set it should use, which makes it meaningful to keep many instances of them around, each with a different character set (or you can create a wxCSConv instance on the fly).
ja: wxCSConv クラスは特別なクラスです。なぜなら、インスタンス化するときに使用する文字コードを指定することができるためです。このことは異なる文字コードのインスタンスを多数保持する場合に意味があります。(もしくは実行時に wxCSConv のインスタンスを作成することができます)

source: The wxCloseEvent handler should only call wxWindow::Destroy to delete the window, and not use the delete operator.
ja: wxCloseEvent ハンドラではウィンドウを破棄するときに wxWindow::Destroy のみを使用するようにし、delete 演算子を使用しないでください。

source: The wxMBConv classes in wxWidgets enable an Unicode-aware application to easily convert between Unicode and the variety of 8-bit encoding systems still in use.
ja: wxMBConv クラスは Unicode を意識したアプリケーションにおいて、依然として使用されている様々な 8 ビットエンコーディングと Unicode との間の変換を簡単に行えるようにします。

source: The wxString class has been completely rewritten for wxWidgets 3.0 but much work has been done to make existing code using ANSI string literals work as it did in previous versions.
ja: wxString クラスは wxWidgets 3.0 では完全に書き直されますが、ANSI リテラル文字列を使用する既存のコードを以前のバージョンと同じように動作させるために様々なことを行っています。

source: The wxValidator::TransferFromWindow member function should transfer the data from the control to the validator or associated C++ variable.
ja: wxValidator::TransferFromWindow 関数はコントロールからバリデータや関連する C++ 変数へデータを転送する必要があります。

source: The wxValidator::TransferToWindow member function should transfer the data from the validator or associated C++ variable to the control.
ja: wxValidator::TransferToWindow 関数はバリデータや関連する C++ 変数からコントロールへデータを転送する必要があります。

source: The wxValidator::Validate member function should return true if the data in the control (not the C++ variable) is valid.
ja: wxValidator::Validate 関数はコントロール (C++ 変数ではありません) のデータが正しい場合に true を返却する必要があります。

source: The wxString constructor then converts it back to an 8-bit character set using the passed conversion object, *wxConvCurrent.
ja: そして、wxString のコンストラクタは引数に指定された変換オブジェクト、つまり *wxConvCurrent を使用して 8 ビット文字コードへ文字列を変換し直します。

source: The UTF or Unicode Transformation Formats are algorithms mapping the Unicode code points to code unit sequences.
ja: UTF (Unicode Transformation Format) は Unicode コードポイントをコード単位の並びにマッピングするためのアルゴリズムです。

source: The wx/string.h> header also defines ::wxSnprintf and ::wxVsnprintf functions which should be used instead of the inherently dangerous standard sprintf() and which use snprintf() instead which does buffer size checks whenever possible.
ja: また、wx/string.h> ヘッダでは ::wxSnprintf 関数と ::wxVsnprintf 関数も定義しています。潜在的に危険な標準の sprintf() の代わりにこれらの関数を使用するべきであり、これらの関数ではバッファサイズのチェックを行なう snprintf() をできるだけ使用しています。

source: The EVT_BUTTON macro demonstrates that the originating event does not have to come from the window class implementing the event table -- if the event source is a button within a panel within a frame, this will still work, because event tables are searched up through the hierarchy of windows for the command events.
ja: EVT_BUTTON マクロはイベントの発生元がウィンドウクラスである必要がないことを表しています。イベントテーブルの検索はウィンドウ階層をたどりながら行われるため、イベントの発生元がフレーム内のパネルにあるボタンである場合でも動作します。

source: The Layout() method is what is called by the default EVT_SIZE handler for container windows.
ja: Layout() 関数はコンテナウィンドウのデフォルトの EVT_SIZE ハンドラから呼ばれます。

source: The dialog sample illustrates this approach by defining a custom log target customizing the dialog used by wxLogGui for the single messages.
ja: ダイアログ サンプルでは wxLogGui でダイアログを使用するようにカスタマイズしたカスタムログターゲットを定義する例を解説しています。

source: The <wx/string.h> header also defines wxSnprintf and wxVsnprintf functions which should be used instead of the inherently dangerous standard sprintf() and which use snprintf() instead which does buffer size checks whenever possible.
ja: また、<wx/string.h> ヘッダでは wxSnprintf 関数と wxVsnprintf 関数も定義しています。潜在的に危険な標準の sprintf() の代わりにこれらの関数を使用するべきであり、これらの関数ではバッファサイズのチェックを行なう snprintf() をできるだけ使用しています。

source: The ASCII NUL character is allowed, but be aware that in the current string implementation some methods might not work correctly in this case.
ja: ASCII NUL 文字を含めることも可能ですが、その場合、現在の実装ではいくつかの関数は正しく動作しないことに注意してください。

source: The BMP contains characters for all modern languages, and a large number of special characters.
ja: BMP にはすべての現代語の文字と、多くの特殊文字が含まれています。

source: The EVT_ACTIVATE and EVT_ACTIVATE_APP macros intercept activation and deactivation events.
ja: EVT_ACTIVATE、EVT_ACTIVATE_APP マクロはアクティブ化、非アクティブ化イベントを捉えます。

source: The EVT_CLOSE macro handles window closure called via wxWindow::Close.
ja: EVT_CLOSE マクロは wxWindow::Close によるウィンドウの終了を処理します。

source: The EVT_DROP_FILES macros handles file drop events.
ja: EVT_DROP_FILES マクロはファイルドロップイベントを処理します。

source: The EVT_ERASE_BACKGROUND macro is used to handle window erase requests.
ja: EVT_ERASE_BACKGROUND マクロはウィンドウの消去要求を処理するために使用されます。

source: The EVT_IDLE macro handle application idle events (to process background tasks, for example).
ja: EVT_IDLE マクロはアプリケーションのアイドルイベントを処理します。 (例えば、バックグラウンド処理などに使用します)

source: The EVT_INIT_DIALOG macro is used to handle dialog initialisation.
ja: EVT_INIT_DIALOG マクロはダイアログの初期化イベントを処理するために使用されます。

source: The EVT_MOVE macro is used to handle a window move.
ja: EVT_MOVE マクロはウィンドウの移動を処理するために使用されます。

source: The EVT_PAINT macro is used to handle window paint requests.
ja: EVT_PAINT マクロはウィンドウの描画要求を処理するために使用されます。

source: The EVT_SET_CURSOR macro is used for special cursor processing.
ja: EVT_SET_CURSOR マクロは特殊なカーソル処理のために使用されます。

source: The EVT_SET_FOCUS and EVT_KILL_FOCUS macros are used to handle keyboard focus events.
ja: EVT_SET_FOCUS、EVT_KILL_FOCUS マクロはキーボードフォーカスイベントを処理するために使用されます。

source: The EVT_SIZE macro doesn't need a window identifier, since normally you are only interested in the current window's size events.
ja: EVT_SIZE マクロはウィンドウ識別子を必要としません。なぜなら、通常は現在のウィンドウのリサイズイベントにのみ関心があるはずだからです。

source: The EVT_SIZE macro is used to handle a window resize.
ja: EVT_SIZE マクロはウィンドウのりサイズを処理するために使用されます。

source: The EVT_SPLITTER_SASH_POS_CHANGED, EVT_SPLITTER_UNSPLIT and EVT_SPLITTER_DCLICK macros are used to handle the various splitter window events.
ja: EVT_SPLITTER_SASH_POS_CHANGED、EVT_SPLITTER_UNSPLIT、EVT_SPLITTER_DCLICK マクロはさまざまなウィンドウ分割イベントを処理するために使用されます。

source: The EVT_SYS_COLOUR_CHANGED macro is used to handle events informing the application that the user has changed the system colours (Windows only).
ja: EVT_SYS_COLOUR_CHANGED マクロはユーザによるシステムカラーの変更イベントを処理するために使用されます。 (Windows のみ)

source: The EVT_UPDATE_UI macro is used to handle user interface update pseudo-events, which are generated to give the application the chance to update the visual state of menus, toolbars and controls.
ja: EVT_UPDATE_UI マクロはアプリケーションがメニュー、ツールバー、コントロールの見た目の状態を変更するための擬似イベントを処理するために使用されます。

source: The Idea Behind Sizers
ja: サイザーの背後にある考え方

source: The Unicode standard divides the space of all possible code points in planes; a plane is a range of 65,536 (1000016) contiguous Unicode code points.
ja: Unicode 標準規格では取りうるすべてのコードポイントを 面 に分割しています; 面とは、連続する 65,536 (1000016) 個の Unicode コードポイントのことです。

source: The actual error might have been detected inside wxWidgets code (say, in wxFile::Write), so the calling function doesn't really know the exact reason of the failure, it only knows that the data file couldn't be written to the disk.
ja: 実際のエラーは wxWidgets コード (wxFile::Write) 内で検知されるため、呼び出し元の関数では失敗の正確な原因を実際に知ることはできず、ディスクへの書き込みに失敗したことしか分かりません。

source: The advantage of using Close instead of Destroy is that it will call any clean-up code defined by the EVT_CLOSE handler; for example it may close a document contained in a window after first asking the user whether the work should be saved.
ja: Destroy の代わりに Close を使用する利点は EVT_CLOSE イベントハンドラで任意の後処理を行える点です。例えば、ユーザに作業中のドキュメントを保存するように確認した後でドキュメントを閉じるといったことができます。

source: The advantages of using a special string class instead of working directly with C strings are so obvious that there is a huge number of such classes available.
ja: C 文字列を直接使用する代わりに特別な文字列クラスを使用する利点は、多くの文字列クラスが存在することから明らかと言えます。

source: The aim of the validator concept is to make dialogs very much easier to write.
ja: バリデータという概念の目的はダイアログをより簡単にコーディングできるようにすることです。

source: The alternative is to explicitly delete child frames in the top-level frame's wxCloseEvent handler.
ja: アプリケーションを終了する別の方法はトップレベルフレームの wxCloseEvent イベントハンドラで明示的に子フレームを削除することです。
